modules/writing.org
#+title: Writing Configuration

* Org Mode
Org Mode configuration for note-taking, task management, and document export.

** Core Settings
- Hard wrap text at 80 characters for cleaner Git diffs
- Record timestamps on task completion
- Hide inline emphasis markers (=*bold*= appears as *bold*)
- Archive completed tasks to an "Archive" heading within the same file
- Collect agenda items from =~/org=, =~/org/roam=, and =~/org/roam/daily=
#+begin_src elisp
(use-package! org
  :hook (org-mode . auto-fill-mode)
  :defer-incrementally t
  :config
  (setq org-log-done 'time
        org-agenda-start-with-log-mode t
        org-hide-emphasis-markers t
        +org-capture-todo-file "Tasks.org"
        org-archive-location "::* Archive"
        org-agenda-files '("~/org"
                           "~/org/roam"
                           "~/org/roam/daily"))

  ;; Use pdf-tools for viewing exported PDFs
  (add-to-list 'org-file-apps '("\\.pdf\\'" . pdf-tools))

  ;; Larger heading fonts for visual hierarchy
  (custom-set-faces!
    '(org-level-1
      :height 1.2
      :inherit outline-1)
    '(org-level-2
      :height 1.1
      :inherit outline-2))

  ;; LaTeX export configuration
  (require 'ox-latex)
  (require 'ox-bibtex)

  ;; Use Tectonic as the LaTeX engine (self-contained, auto-fetches dependencies)
  (setq org-latex-pdf-process
        `(,(concat "tectonic --outdir=%o %f -Z search-path=" doom-user-dir "latex")))

  ;; Use engrave-faces for syntax-highlighted code blocks in LaTeX
  (setq org-latex-src-block-backend 'engraved)

  ;; Additional LaTeX packages for better tables and colours
  (setq org-latex-packages-alist '(("" "booktabs")
                                   ("" "tabularx")
                                   ("" "color")))

  ;; Custom 'mimore' document class for exports
  (add-to-list 'org-latex-classes
               '("mimore"
                 "\\documentclass{mimore}\n\[NO-DEFAULT-PACKAGES\]\n\[PACKAGES\]\n\[EXTRA\]"
                 ("\\section{%s}" . "\\section\*{%s}")
                 ("\\subsection{%s}" . "\\subsection\*{%s}")
                 ("\\subsubsection{%s}" . "\\subsubsection\*{%s}")
                 ("\\paragraph{%s}" . "\\paragraph\*{%s}")
                 ("\\subparagraph{%s}" . "\\subparagraph\*{%s}")))
  (setq org-latex-default-class "mimore"))
#+end_src

** Org-Tree-Slide
Present directly from Org buffers using =org-tree-slide=. Top-level headings
become slides, with the fancy profile enabled for animations.
#+begin_src elisp
(use-package! org-tree-slide
  :after org
  :config
  (setq org-tree-slide-skip-outline-level 2)
  (org-tree-slide-presentation-profile))
#+end_src

** Org Roam
Org Roam extends Org Mode into a personal knowledge graph. The graph display
hides common link types (file, http, https) to reduce visual noise.
#+begin_src elisp
(use-package! org-roam
  :after org
  :config
  (setq org-roam-graph-link-hidden-types
        '("file" "http" "https")))
#+end_src

** Org Roam UI
Web-based graph visualization for Org Roam. Syncs with the current Emacs theme
and follows the active buffer.
#+begin_src elisp
(use-package! websocket
  :after org-roam)

(use-package! org-roam-ui
  :after org-roam
  :config
  (setq org-roam-ui-sync-theme t
        org-roam-ui-follow t
        org-roam-ui-update-on-save t
        org-roam-ui-open-on-start t))
#+end_src

** Calendar
Map =SPC o c= to open a full calendar view via =calfw=, complementing the standard
=org-agenda= view.
#+begin_src elisp
(map! :leader
      :prefix ("o" . "open")
      :desc "Open calendar" "c" #'cfw:open-org-calendar)
#+end_src

* Markdown
Configure =grip-mode= for GitHub-flavored Markdown preview. Credentials are loaded
from =~/.authinfo= to avoid API rate limiting.
#+begin_src elisp
(require 'auth-source)

(let ((credential (auth-source-user-and-password "api.github.com")))
  (setq grip-github-user (car credential)
        grip-github-password (cadr credential)))
#+end_src
